#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/YtseJam/canary-rolling/runs/run-KQDzzR3B21o3CeUB

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.lb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-4126128097]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02fdd976dc15358bb]
module.http_80_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-4238081842]
module.lb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07c254d07e00e4cb1]
module.http_80_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0e23d399a4be7fb12]
module.lb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2107838978]
module.http_80_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3964448640]
module.lb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-875153517]
module.http_80_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-704279483]
aws_lb_target_group.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-012509703aef2baf1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f0633d91370d731b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2ca6eea23a71835]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4f35d428d06277e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d68d602a8bc714b5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-008d548389d3f68d7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b09d3b8a3abe0d17]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b59983eab883e59c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07b2d09c8ee7f7817]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d92023b7b0a9b60a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-092bffe8da51b2f05]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06331fa3459aa2ed9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0440aab6a6a78f339]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b59983eab883e59c1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-092175a41bdc6623a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029ce3333824c2765]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05087b9bfb63603f3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04dc82de06f5e347b]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb_listener.http has changed
  ~ resource "aws_lb_listener" "http" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.alb.aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
        id                         = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359"
        name                       = "alb-canary-rolling-deployment"
      ~ security_groups            = [
          - "sg-07c254d07e00e4cb1",
        ] -> (known after apply)
        tags                       = {
            "Name" = "alb-canary-rolling-deployment"
        }
        # (16 unchanged attributes hidden)



        # (5 unchanged blocks hidden)
    }

  # module.http_80_security_group.module.sg.aws_security_group.this_name_prefix[0] will be destroyed
  # (because aws_security_group.this_name_prefix is not in configuration)
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:660346824954:security-group/sg-0e23d399a4be7fb12" -> null
      - description            = "Security group for web servers with HTTP ports open within VPC" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All protocols"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0e23d399a4be7fb12" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress Rule"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - name                   = "web-sg-20220301063552447900000001" -> null
      - name_prefix            = "web-sg-" -> null
      - owner_id               = "660346824954" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "web-sg"
        } -> null
      - tags_all               = {
          - "Name" = "web-sg"
        } -> null
      - vpc_id                 = "vpc-02fdd976dc15358bb" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.http_80_security_group.module.sg.aws_security_group_rule.egress_rules[0] will be destroyed
  # (because aws_security_group_rule.egress_rules is not in configuration)
  - resource "aws_security_group_rule" "egress_rules" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "All protocols" -> null
      - from_port         = 0 -> null
      - id                = "sgrule-704279483" -> null
      - ipv6_cidr_blocks  = [
          - "::/0",
        ] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0e23d399a4be7fb12" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.http_80_security_group.module.sg.aws_security_group_rule.ingress_rules[0] will be destroyed
  # (because aws_security_group_rule.ingress_rules is not in configuration)
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "HTTP" -> null
      - from_port         = 80 -> null
      - id                = "sgrule-3964448640" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0e23d399a4be7fb12" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.http_80_security_group.module.sg.aws_security_group_rule.ingress_with_self[0] will be destroyed
  # (because aws_security_group_rule.ingress_with_self is not in configuration)
  - resource "aws_security_group_rule" "ingress_with_self" {
      - cidr_blocks              = [] -> null
      - description              = "Ingress Rule" -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-4238081842" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-0e23d399a4be7fb12" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0e23d399a4be7fb12" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # module.lb_security_group.module.sg.aws_security_group.this_name_prefix[0] will be destroyed
  # (because aws_security_group.this_name_prefix is not in configuration)
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:660346824954:security-group/sg-07c254d07e00e4cb1" -> null
      - description            = "Security group for web servers with HTTP ports open within VPC" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All protocols"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-07c254d07e00e4cb1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress Rule"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - name                   = "lb-sg-20220301063552448900000002" -> null
      - name_prefix            = "lb-sg-" -> null
      - owner_id               = "660346824954" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "lb-sg"
        } -> null
      - tags_all               = {
          - "Name" = "lb-sg"
        } -> null
      - vpc_id                 = "vpc-02fdd976dc15358bb" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.lb_security_group.module.sg.aws_security_group_rule.egress_rules[0] will be destroyed
  # (because aws_security_group_rule.egress_rules is not in configuration)
  - resource "aws_security_group_rule" "egress_rules" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "All protocols" -> null
      - from_port         = 0 -> null
      - id                = "sgrule-875153517" -> null
      - ipv6_cidr_blocks  = [
          - "::/0",
        ] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-07c254d07e00e4cb1" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.lb_security_group.module.sg.aws_security_group_rule.ingress_rules[0] will be destroyed
  # (because aws_security_group_rule.ingress_rules is not in configuration)
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "HTTP" -> null
      - from_port         = 80 -> null
      - id                = "sgrule-2107838978" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-07c254d07e00e4cb1" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.lb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0] will be destroyed
  # (because aws_security_group_rule.ingress_with_self is not in configuration)
  - resource "aws_security_group_rule" "ingress_with_self" {
      - cidr_blocks              = [] -> null
      - description              = "Ingress Rule" -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-4126128097" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-07c254d07e00e4cb1" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-07c254d07e00e4cb1" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # module.lb_sg.module.sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers with HTTP ports open within VPC"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "lb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "lb-sg"
        }
      + tags_all               = {
          + "Name" = "lb-sg"
        }
      + vpc_id                 = "vpc-02fdd976dc15358bb"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.lb_sg.module.sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.lb_sg.module.sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.lb_sg.module.sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.web_sg.module.sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers with HTTP ports open within VPC"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-sg"
        }
      + tags_all               = {
          + "Name" = "web-sg"
        }
      + vpc_id                 = "vpc-02fdd976dc15358bb"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.web_sg.module.sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.web_sg.module.sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.web_sg.module.sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 8 to add, 1 to change, 8 to destroy.

Changes to Outputs:
  + aws_region       = "ap-southeast-1"
  + public_subnets   = [
      + "subnet-0f2ca6eea23a71835",
      + "subnet-0d4f35d428d06277e",
      + "subnet-0d68d602a8bc714b5",
    ]
  + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c"
  + web_sg_id        = (known after apply)

```
</details>
*Pusher: @adadeeeh, Action: `pull_request`*